# IsEmpty Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
MassZone..::..IsEmpty Method
MassZone Class See Also
---
Indicates if MassZone has no geometry. Such zones should not be shown to the user.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsEmpty()
```

Visual Basic
---
```text
Public Function IsEmpty As Boolean
```

Visual C++
---
```text
public:
bool IsEmpty()
```

# ### Return Value
Returns True if MassZone has no geometry.
# See Also
MassZone Class
Autodesk.Revit.DB.Analysis Namespace